{
  "XA": {
    "locations": [
      "topside", {
        "id": "1",
        "name": "your bedroom",
        "left": null,
        "right": "2",
        "back": null,
        "forward": null,
        "description": "The room is simple, with a single window facing the street thirty stories below. \nYour bed is covered with a simple grey blanket and a small pillow rests at the head.\nYour closet is closed and a small box fan blows fresh air from the open window."
      }, {
        "id": "2",
        "name": "the hall",
        "left": "1",
        "right": null,
        "back": null,
        "forward": "3",
        "description": "The hall is empty, the walls bare except for a single painting of a lighthouse halfway along \nthe left wall. The stairs to the rest of your apartment are at the end of the hall."
      }, {
        "id": "3",
        "name": "the stairs",
        "left": null,
        "right": null,
        "back": "2",
        "forward": "4",
        "description": "You know what stairs look like."
      }, {
        "id": "4",
        "name": "the living room",
        "left": "5",
        "right": "6",
        "back": "3",
        "forward": "7",
        "description": "A small couch sits against the far wall to the left of the door. Opposite that is a small\nbut full bookcase, on top of which sits a television. Further left is the entrance to the kitchen.\nThis room is sparse, similar to your bedroom and hall."
      }, {
        "id": "5",
        "name": "kitchen",
        "left": null,
        "right": null,
        "back": "4",
        "forward": null,
        "description": "Your kitchen is simple but well-equipped, with a hanging pot rack above the island in the center.\nA sliding glass door at the rear leads out to a narrow balcony where your laundry is drying."
      }, {
        "id": "6",
        "name": "the closet",
        "left": null,
        "right": null,
        "back": "4",
        "forward": null,
        "description": "Inside the closet you find several rain jackets and coats, a pair of atheltic shoes,\nheavy boots, and sandals. On the right wall hangs your bike, and to the rear is the washing machine."
      }, {
        "id": "7",
        "name": "the door",
        "left": null,
        "right": null,
        "back": "4",
        "forward": "8",
        "description": "Your door is heavy, with a pair of deadbolts and a chain lock. Your keys hang on a hook to your left."
      }
    ]
  }
}
